// Напишіть код JavaScript, який буде здатний знайти всі входження заданого ключового слова або фрази в заданому тексті. 
// Ваш код повинен виводити масив всіх знайдених ключових слів або фраз.
// Вимоги:
// Використовуйте регулярні вирази для знаходження ключових слів.
// Ігноруйте регістр (великі/маленькі букви) при пошуку.
// Виведіть результат у консоль.

// Приклад вхідних даних:
// const text = "Це приклад рядка з ключовим словом javascript і JavaScript є дуже цікавою мовою.";
// const keyword = "JavaScript";

const text1 = "Це приклад рядка з ключовим словом javascript і JavaScript є дуже цікавою мовою.";
const keyword1 = "JavaScript";
const exp1 = `(?=${keyword1})`;
const regexp1 = RegExp(exp1, 'gmi');
const resultArray1 = [...text1.matchAll(regexp1)];
console.log("Bсі входження заданого ключового слова або фрази в заданому тексті. ")
console.dir(resultArray1);
console.log('-'.repeat(40));


// Напишіть код, який буде розділяти заданий текст на рядки або слова та виводити їх у масивах.

// Вимоги:
// Використовуйте регулярні вирази для розділення тексту.
// Спершу розділіть текст на рядки, виведіть результат.
// Далі розділіть текст на слова, виведіть результат.

// Приклад вхідних даних:
// const textToSplit = "Це є перший рядок.\nЦе є другий рядок.\nЦе є третій рядок.";

console.log("розділяти заданий текст на рядки або слова та виводити їх у масивах.");

const textToSplit2 = "Це є перший рядок.\nЦе є другий рядок.\nЦе є третій рядок.";
const resultLines2 = textToSplit2.split(/\r?\n/);
const resultWords2 = textToSplit2.split(/[\r\n\t ]+/);
console.log("текст на рядки:");
console.dir(resultLines2);
console.log("текст на слова:");
console.dir(resultWords2);